Revit 2027 API
ConnectorElement.Direction Property
 Gets the direction of the connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; }
Public ReadOnly Property Direction As XYZ
	Get
public:
property XYZ^ Direction {
	XYZ^ get ();
}
member Direction : XYZ with get
Property Value
XYZ
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace